# SetNullValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..SetNullValue Method
ScheduleFilter Class See Also
---
Sets the filter to have no specified value (used for HasParameter filters).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetNullValue()
```

Visual Basic
---
```text
Public Sub SetNullValue
```

Visual C++
---
```text
public:
void SetNullValue()
```

# See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace